point_1 = [0, 0]
point_2 = [23, 17]

cords = [1, 14]

c = ((point_2[0] - point_1[0]) ** 2 + (point_2[1] - point_1[1]) ** 2) ** 0.5
a = ((cords[0] - point_1[0]) ** 2 + (cords[1] - point_1[1]) ** 2) ** 0.5
b = ((point_2[0] - cords[0]) ** 2 + (point_2[1] - cords[1]) ** 2) ** 0.5

# -z < a + b - c < +z где:
# а - расстояние от начальной точки до дрона
# b - расстояние от дрона до конечной точки
# c - расстояние от начальной до конечной точки
# z - допустимая погрешность
print(a, b, c)
print(a + b - c)
